OpenFOAM-v1812/tutorials/lagrangian/reactingParcelFoam/hotBoxes/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

./Allrun.pre

runApplication $(getApplication)

#------------------------------------------------------------------------------
